to check i the colunmn has only one value

In [1]:
import pandas as pd

In [2]:
!pip install ctrl4ai
from ctrl4ai import preprocessing
from ctrl4ai import automl
from ctrl4ai import datasets

Collecting ctrl4ai
  Downloading https://files.pythonhosted.org/packages/6b/a8/ee64208bbc94f4e4dffac49a6252ba01f59046047d051fef3fbff5ff27af/ctrl4ai-1.0.2-py3-none-any.whl
Requirement already satisfied: scipy==1.4.1 in /usr/local/lib/python3.6/dist-packages (from ctrl4ai) (1.4.1)
Requirement already satisfied: requests in /usr/local/lib/python3.6/dist-packages (from ctrl4ai) (2.23.0)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from ctrl4ai) (1.0.5)
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from ctrl4ai) (1.18.5)
Collecting scikit-learn>=0.23.1
  Downloading https://files.pythonhosted.org/packages/d9/3a/eb8d7bbe28f4787d140bb9df685b7d5bf6115c0e2a969def4027144e98b6/scikit_learn-0.23.1-cp36-cp36m-manylinux1_x86_64.whl (6.8MB)
     |████████████████████████████████| 6.9MB 4.0MB/s
Requirement already satisfied: geopy>=1.17.0 in /usr/local/lib/python3.6/dist-packages (from ctrl4ai) (1.17.0)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests->ctrl4ai) (2020.6.20)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests->ctrl4ai) (2.10)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests->ctrl4ai) (1.24.3)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests->ctrl4ai) (3.0.4)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->ctrl4ai) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->ctrl4ai) (2018.9)
Collecting threadpoolctl>=2.0.0
  Downloading https://files.pythonhosted.org/packages/f7/12/ec3f2e203afa394a149911729357aa48affc59c20e2c1c8297a60f33f133/threadpoolctl-2.1.0-py3-none-any.whl
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.6/dist-packages (from scikit-learn>=0.23.1->ctrl4ai) (0.16.0)
Requirement already satisfied: geographiclib<2,>=1.49 in /usr/local/lib/python3.6/dist-packages (from geopy>=1.17.0->ctrl4ai) (1.50)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas->ctrl4ai) (1.15.0)
Installing collected packages: threadpoolctl, scikit-learn, ctrl4ai
  Found existing installation: scikit-learn 0.22.2.post1
    Uninstalling scikit-learn-0.22.2.post1:
      Successfully uninstalled scikit-learn-0.22.2.post1
Successfully installed ctrl4ai-1.0.2 scikit-learn-0.23.1 threadpoolctl-2.1.0

In [3]:
dataset = pd.read_csv('titanic.csv')

In [4]:
from ctrl4ai import helper
categorical_variable = [ i for i in dataset.columns
            if helper.check_categorical_col(dataset[i]) == True ]

In [5]:
df = helper.one_hot_encoding(dataset, categorical_variable,)

In [6]:
df.head()

   PassengerId  ... Embarked_S
0            1  ...          1
1            2  ...          0
2            3  ...          1
3            4  ...          1
4            5  ...          1

[5 rows x 176 columns]

In [7]:
dataset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [8]:
from ctrl4ai import helper
single_valued_column = [ i for i in dataset.columns
            if helper.single_valued_col(dataset[i]) == True ]

for e in single_valued_column:
    DataFrame.drop(labels=single_valued_column[e], axis=1)

In [9]:
dataset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [19]:
t = preprocessing.drop_non_numeric(dataset)

Dropping non categorical/continuous column(s):Name,Sex,Ticket,Cabin,Embarked

In [21]:
li1 = dataset.columns
li2 = t.columns

In [22]:
temp3 = [item for item in li1 if item not in li2]

In [23]:
# these are basiicallly non numeric columns in the dataset but the columns may be categorical that we havent checked yet...
#so we need to check if the column is categorical or not and  do the changes that are required for the same.....

temp3

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [24]:
li3 = categorical_variable
li4 = temp3

In [28]:
temp4 =  [item for item in temp3 if item in li3]

In [29]:
#columns which are categorical and removed in the baove non- numeric functon
# non numeric categorical variables.............................................

temp4

['Sex', 'Cabin', 'Embarked']

In [30]:
to_be_removed = [item for item in temp3 if item not in temp4]

In [31]:
to_be_removed

['Name', 'Ticket']

In [32]:
# now droping the columns from the data
new_data_set = dataset.drop(to_be_removed, axis=1)

In [33]:
new_data_set.head()

   PassengerId  Survived  Pclass     Sex  ...  Parch     Fare  Cabin  Embarked
0            1         0       3    male  ...      0   7.2500    NaN         S
1            2         1       1  female  ...      0  71.2833    C85         C
2            3         1       3  female  ...      0   7.9250    NaN         S
3            4         1       1  female  ...      0  53.1000   C123         S
4            5         0       3    male  ...      0   8.0500    NaN         S

[5 rows x 10 columns]

In [38]:
no_of_rows = len(dataset.index)

In [39]:
no_of_rows

891

In [45]:
threshold = (4/no_of_rows)

In [46]:
threshold

0.004489337822671156

In [35]:
categorical_variable

['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Cabin', 'Embarked']

In [48]:
new_data = automl.preprocess(new_data_set,'unsupervised', 
                             impute_null_method='central_tendency', tranform_categorical='label_encoding',
                             categorical_threshold=0.05, remove_outliers=False,
                             log_transform=None, drop_null_dominated=True,
                             dropna_threshold=0.3, derive_from_datetime=True, 
                             define_continuous_cols=[], define_categorical_cols=[])

Dropping null dominated column(s) Cabin
Columns identified as continuous are PassengerId,Age,Fare
Columns identified as categorical are Survived,Pclass,Sex,SibSp,Parch,Embarked
Replaced nulls in Embarked with mode
Labels for Sex: {'male': 0, 'female': 1}
Labels for Embarked: {'S': 0, 'C': 1, 'Q': 2}
Replaced nulls in Age with mean

In [44]:
new_data

({'Embarked': {'C': 1, 'Q': 2, 'S': 0}, 'Sex': {'female': 1, 'male': 0}},
      Survived  Pclass Sex        Age  ...  Parch  Embarked PassengerId     Fare
 0           0       3   0  22.000000  ...      0         0           1   7.2500
 1           1       1   1  38.000000  ...      0         1           2  71.2833
 2           1       3   1  26.000000  ...      0         0           3   7.9250
 3           1       1   1  35.000000  ...      0         0           4  53.1000
 4           0       3   0  35.000000  ...      0         0           5   8.0500
 ..        ...     ...  ..        ...  ...    ...       ...         ...      ...
 886         0       2   0  27.000000  ...      0         0         887  13.0000
 887         1       1   1  19.000000  ...      0         0         888  30.0000
 888         0       3   1  29.699118  ...      2         0         889  23.4500
 889         1       1   0  26.000000  ...      0         1         890  30.0000
 890         0       3   0  32.000000  ...      0         2         891   7.7500

 [891 rows x 9 columns])